## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 67 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                            NAME                                                                            |
|--------|------------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_iam_policy.access_quicksight`                                                                                                                         |
|        | `aws_iam_policy.admin_pointpoint_sms`                                                                                                                      |
|        | `aws_iam_policy.admin_s3_website_assets`                                                                                                                   |
|        | `aws_iam_policy.notify_access_ecs_blazer`                                                                                                                  |
|        | `aws_iam_policy.remove_ses_sns_suppressed`                                                                                                                 |
|        | `aws_identitystore_group.notify_dev_access_vpc_clientvpn`                                                                                                  |
|        | `aws_identitystore_group.notify_dev_admin`                                                                                                                 |
|        | `aws_identitystore_group.notify_dev_read_only`                                                                                                             |
|        | `aws_identitystore_group.notify_production_access_ecs_blazer`                                                                                              |
|        | `aws_identitystore_group.notify_production_access_quicksight`                                                                                              |
|        | `aws_identitystore_group.notify_production_access_vpc_clientvpn`                                                                                           |
|        | `aws_identitystore_group.notify_production_admin`                                                                                                          |
|        | `aws_identitystore_group.notify_production_admin_pinpoint_sms`                                                                                             |
|        | `aws_identitystore_group.notify_production_admin_s3_website_assets`                                                                                        |
|        | `aws_identitystore_group.notify_production_admin_support_center`                                                                                           |
|        | `aws_identitystore_group.notify_production_billing`                                                                                                        |
|        | `aws_identitystore_group.notify_production_read_only`                                                                                                      |
|        | `aws_identitystore_group.notify_sandbox_admin`                                                                                                             |
|        | `aws_identitystore_group.notify_sandbox_read_only`                                                                                                         |
|        | `aws_identitystore_group.notify_staging_access_ecs_blazer`                                                                                                 |
|        | `aws_identitystore_group.notify_staging_access_vpc_clientvpn`                                                                                              |
|        | `aws_identitystore_group.notify_staging_admin`                                                                                                             |
|        | `aws_identitystore_group.notify_staging_admin_pinpoint_sms`                                                                                                |
|        | `aws_identitystore_group.notify_staging_admin_s3_website_assets`                                                                                           |
|        | `aws_identitystore_group.notify_staging_admin_support_center`                                                                                              |
|        | `aws_identitystore_group.notify_staging_billing`                                                                                                           |
|        | `aws_identitystore_group.notify_staging_read_only`                                                                                                         |
|        | `aws_ssoadmin_account_assignment.notify_dev[&quot;Notify-Dev-Admin&quot;]`                                                                                           |
|        | `aws_ssoadmin_account_assignment.notify_dev[&quot;Notify-Dev-ReadOnly&quot;]`                                                                                        |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Access-ECS-Blazer&quot;]`                                                                 |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Access-QuickSight&quot;]`                                                                 |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin&quot;]`                                                                             |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-Pinpoint-SMS&quot;]`                                                                |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-S3-WebsiteAssets&quot;]`                                                            |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-SupportCenter&quot;]`                                                               |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Billing&quot;]`                                                                           |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-ReadOnly&quot;]`                                                                          |
|        | `aws_ssoadmin_account_assignment.notify_sandbox[&quot;Notify-Sandbox-Admin&quot;]`                                                                                   |
|        | `aws_ssoadmin_account_assignment.notify_sandbox[&quot;Notify-Sandbox-ReadOnly&quot;]`                                                                                |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Access-ECS-Blazer&quot;]`                                                                       |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin&quot;]`                                                                                   |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-Pinpoint-SMS&quot;]`                                                                      |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-S3-WebsiteAssets&quot;]`                                                                  |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-SupportCenter&quot;]`                                                                     |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Billing&quot;]`                                                                                 |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-ReadOnly&quot;]`                                                                                |
|        | `aws_ssoadmin_customer_managed_policy_attachment.access_quicksight`                                                                                        |
|        | `aws_ssoadmin_customer_managed_policy_attachment.admin_pointpoint_sms`                                                                                     |
|        | `aws_ssoadmin_customer_managed_policy_attachment.admin_s3_website_assets`                                                                                  |
|        | `aws_ssoadmin_customer_managed_policy_attachment.notify_access_ecs_blazer`                                                                                 |
|        | `aws_ssoadmin_customer_managed_policy_attachment.remove_ses_sns_suppressed`                                                                                |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/AWSQuickSightIoTAnalyticsAccess&quot;]`                                      |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRDS&quot;]`                                |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRedshift&quot;]`                           |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightElasticsearchPolicy&quot;]`                        |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightListIAM&quot;]`                                    |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightTimestreamPolicy&quot;]`                           |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuicksightAthenaAccess&quot;]`                               |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuicksightOpenSearchPolicy&quot;]`                           |
|        | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/QuickSightAccessForS3StorageManagementAnalyticsReadOnly&quot;]` |
|        | `aws_ssoadmin_managed_policy_attachment.admin_support_center[&quot;arn:aws:iam::aws:policy/AWSSupportAccess&quot;]`                                                  |
|        | `aws_ssoadmin_managed_policy_attachment.admin_support_center[&quot;arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess&quot;]`                                          |
|        | `aws_ssoadmin_permission_set.access_quicksight`                                                                                                            |
|        | `aws_ssoadmin_permission_set.admin_pointpoint_sms`                                                                                                         |
|        | `aws_ssoadmin_permission_set.admin_s3_website_assets`                                                                                                      |
|        | `aws_ssoadmin_permission_set.admin_support_center`                                                                                                         |
|        | `aws_ssoadmin_permission_set.notify_access_ecs_blazer`                                                                                                     |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/9021583364).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.access_quicksight will be created
  + resource "aws_iam_policy" "access_quicksight" {
      + arn         = (known after apply)
      + description = "Grants access to QuickSight."
      + id          = (known after apply)
      + name        = "Access-QuickSight"
      + name_prefix = (known after apply)
      + path        = "/identity-center/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "quicksight:UpdateFolderMembership",
                          + "quicksight:UpdateFolder",
                          + "quicksight:UpdateDataSet",
                          + "quicksight:UpdateDashboard",
                          + "quicksight:UpdateAnalysis",
                          + "quicksight:UntagResource",
                          + "quicksight:TagResource",
                          + "quicksight:Search*",
                          + "quicksight:RestoreAnalysis",
                          + "quicksight:Pass*",
                          + "quicksight:List*",
                          + "quicksight:Get*",
                          + "quicksight:Describe*",
                          + "quicksight:DeleteFolderMembership",
                          + "quicksight:DeleteFolder",
                          + "quicksight:DeleteDataSet",
                          + "quicksight:DeleteDashboard",
                          + "quicksight:DeleteAnalysis",
                          + "quicksight:CreateFolderMembership",
                          + "quicksight:CreateFolder",
                          + "quicksight:CreateDataSet",
                          + "quicksight:CreateDashboard",
                          + "quicksight:CreateAnalysis",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "QuickSightAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.admin_pointpoint_sms will be created
  + resource "aws_iam_policy" "admin_pointpoint_sms" {
      + arn         = (known after apply)
      + description = "Full access to Pointpoint SMS Voice."
      + id          = (known after apply)
      + name        = "Admin-Pinpoint-SMS"
      + name_prefix = (known after apply)
      + path        = "/identity-center/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:ListTopics",
                          + "ses:List*",
                          + "ses:Get*",
                          + "ses:Describe*",
                          + "s3:List*",
                          + "mobiletargeting:List*",
                          + "mobiletargeting:Get*",
                          + "kinesis:ListStreams",
                          + "iam:ListRoles",
                          + "firehose:ListDeliveryStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DataRead"
                    },
                  + {
                      + Action   = "sms-voice:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SMSVoiceFullAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.admin_s3_website_assets will be created
  + resource "aws_iam_policy" "admin_s3_website_assets" {
      + arn         = (known after apply)
      + description = "Grants ability to manage the Notify S3 website assets."
      + id          = (known after apply)
      + name        = "Admin-S3-WebsiteAssets"
      + name_prefix = (known after apply)
      + path        = "/identity-center/notify/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListAllOwnedS3Buckets"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-asset-upload",
                          + "arn:aws:s3:::notification-canada-ca-production-asset-upload",
                          + "arn:aws:s3:::notification-alpha-canada-ca-asset-upload",
                        ]
                      + Sid      = "ListS3AssetBuckets"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-asset-upload/*",
                          + "arn:aws:s3:::notification-canada-ca-production-asset-upload/*",
                          + "arn:aws:s3:::notification-alpha-canada-ca-asset-upload/*",
                        ]
                      + Sid      = "AdminS3AssetBucketObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.notify_access_ecs_blazer will be created
  + resource "aws_iam_policy" "notify_access_ecs_blazer" {
      + arn         = (known after apply)
      + description = "Manage SSM sessions to connect to the Blazer ECS Task."
      + id          = (known after apply)
      + name        = "Notify-Access-ECS-Blazer"
      + name_prefix = (known after apply)
      + path        = "/identity-center/notify/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:StartSession"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1::document/AWS-StartPortForwardingSession",
                          + "arn:aws:ecs:ca-central-1:*:task/blazer/*",
                        ]
                      + Sid      = "SSMSessionStartBlazer"
                    },
                  + {
                      + Action   = [
                          + "ssm:TerminateSession",
                          + "ssm:ResumeSession",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSessionManage"
                    },
                  + {
                      + Action    = [
                          + "ecs:ListTasks",
                          + "ecs:DescribeTasks",
                        ]
                      + Condition = {
                          + arn_like = {
                              + "ecs:cluster" = "arn:aws:ecs:ca-central-1:*:cluster/blazer"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ECSTaskBlazerRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.remove_ses_sns_suppressed will be created
  + resource "aws_iam_policy" "remove_ses_sns_suppressed" {
      + arn         = (known after apply)
      + description = "Remove SES and SNS suppressed phone numbers and email addresses."
      + id          = (known after apply)
      + name        = "Remove-SES-SNS-Suppressed"
      + name_prefix = (known after apply)
      + path        = "/identity-center/notify/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:List*",
                          + "ses:Get*",
                          + "ses:DeleteSuppressedDestination",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SESReadAndDeleteSuppressed"
                    },
                  + {
                      + Action   = [
                          + "sns:OptInPhoneNumber",
                          + "sns:ListPhoneNumbersOptedOut",
                          + "sns:CheckIfPhoneNumberIsOptedOut",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SNSListAndDeleteOptedOutNumbers"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_identitystore_group.notify_dev_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_dev_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Dev Client VPN."
      + display_name      = "Notify-Dev-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_dev_admin will be created
  + resource "aws_identitystore_group" "notify_dev_admin" {
      + description       = "Grants members administrator access to the Notify Dev account."
      + display_name      = "Notify-Dev-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_dev_read_only will be created
  + resource "aws_identitystore_group" "notify_dev_read_only" {
      + description       = "Grants members read-only access to the Notify Dev account."
      + display_name      = "Notify-Dev-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_ecs_blazer will be created
  + resource "aws_identitystore_group" "notify_production_access_ecs_blazer" {
      + description       = "Grants members access to the Notify Production account's ECS Blazer task."
      + display_name      = "Notify-Production-Access-ECS-Blazer"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_quicksight will be created
  + resource "aws_identitystore_group" "notify_production_access_quicksight" {
      + description       = "Grants members access to the Notify Production account's QuickSight service."
      + display_name      = "Notify-Production-Access-QuickSight"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_production_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Production Client VPN."
      + display_name      = "Notify-Production-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin will be created
  + resource "aws_identitystore_group" "notify_production_admin" {
      + description       = "Grants members administrator access to the Notify Production account."
      + display_name      = "Notify-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_pinpoint_sms will be created
  + resource "aws_identitystore_group" "notify_production_admin_pinpoint_sms" {
      + description       = "Grants members administrator access to the Notify Production account's Pinpoint SMS service."
      + display_name      = "Notify-Production-Admin-Pinpoint-SMS"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_s3_website_assets will be created
  + resource "aws_identitystore_group" "notify_production_admin_s3_website_assets" {
      + description       = "Grants members administrator access to the Notify Production account's S3 website asset upload buckets."
      + display_name      = "Notify-Production-Admin-S3-WebsiteAssets"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_admin_support_center will be created
  + resource "aws_identitystore_group" "notify_production_admin_support_center" {
      + description       = "Grants members administrator access to the Notify Production account's Support Center."
      + display_name      = "Notify-Production-Admin-SupportCenter"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_billing will be created
  + resource "aws_identitystore_group" "notify_production_billing" {
      + description       = "Grants members billing access to the Notify Production account."
      + display_name      = "Notify-Production-Billing"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_production_read_only will be created
  + resource "aws_identitystore_group" "notify_production_read_only" {
      + description       = "Grants members read-only access to the Notify Production account."
      + display_name      = "Notify-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_sandbox_admin will be created
  + resource "aws_identitystore_group" "notify_sandbox_admin" {
      + description       = "Grants members administrator access to the Notify Sandbox account."
      + display_name      = "Notify-Sandbox-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_sandbox_read_only will be created
  + resource "aws_identitystore_group" "notify_sandbox_read_only" {
      + description       = "Grants members read-only access to the Notify Sandbox account."
      + display_name      = "Notify-Sandbox-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_access_ecs_blazer will be created
  + resource "aws_identitystore_group" "notify_staging_access_ecs_blazer" {
      + description       = "Grants members access to the Notify Staging account's ECS Blazer task."
      + display_name      = "Notify-Staging-Access-ECS-Blazer"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "notify_staging_access_vpc_clientvpn" {
      + description       = "Grants members access to the Notify Staging Client VPN."
      + display_name      = "Notify-Staging-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin will be created
  + resource "aws_identitystore_group" "notify_staging_admin" {
      + description       = "Grants members administrator access to the Notify Staging account."
      + display_name      = "Notify-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_pinpoint_sms will be created
  + resource "aws_identitystore_group" "notify_staging_admin_pinpoint_sms" {
      + description       = "Grants members administrator access to the Notify Staging account's Pinpoint service."
      + display_name      = "Notify-Staging-Admin-Pinpoint-SMS"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_s3_website_assets will be created
  + resource "aws_identitystore_group" "notify_staging_admin_s3_website_assets" {
      + description       = "Grants members administrator access to the Notify Staging account's S3 website asset upload buckets."
      + display_name      = "Notify-Staging-Admin-S3-WebsiteAssets"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_admin_support_center will be created
  + resource "aws_identitystore_group" "notify_staging_admin_support_center" {
      + description       = "Grants members administrator access to the Notify Staging account's Support Center."
      + display_name      = "Notify-Staging-Admin-SupportCenter"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_billing will be created
  + resource "aws_identitystore_group" "notify_staging_billing" {
      + description       = "Grants members billing access to the Notify Staging account."
      + display_name      = "Notify-Staging-Billing"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.notify_staging_read_only will be created
  + resource "aws_identitystore_group" "notify_staging_read_only" {
      + description       = "Grants members read-only access to the Notify Staging account."
      + display_name      = "Notify-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_dev" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "800095993820"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_dev" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "800095993820"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Access-ECS-Blazer"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Access-QuickSight"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-Pinpoint-SMS"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-S3-WebsiteAssets"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-SupportCenter"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Billing"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c8b449ab19badad7"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_sandbox" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "891376947407"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_sandbox" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "891376947407"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Access-ECS-Blazer"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-Pinpoint-SMS"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-S3-WebsiteAssets"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-SupportCenter"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Billing"] will be created
  + resource...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.access_quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.admin_pointpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.remove_ses_sns_suppressed"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.access_quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pointpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
